`Pair Programming Limpieza IV nulos `


1. Lo primero que tenemos que evaluar es en que columnas tenemos nulos y que cantidad tenemos en cada una. ¿Hay alguna columna con una gran cantidad de nulos? En caso de que sea así deberemos eliminarla.

In [2]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import sidetable
import regex as re

df=pd.read_csv('../Datos/attacks_limpieza_III.csv')
df.head(2)

,case_number,year,type,country,area,location,activity,name,time,species,siglo,species_,injury,mes,fatal_bien,genero_bien,categorias_tiburones,edades
0,2018.06.25,2018,Boating,usa,California,"Oceanside, San Diego County",Paddling,Julie Wolfe,18h00,White shark,siglo - XXI,NaN,"No injury to occupant, outrigger canoe and pad...",Jun,N,F,White,57.0
1,2018.06.03.a,2018,Unprovoked,brazil,Pernambuco,"Piedade Beach, Recife",Swimming,Jose Ernesto da Silva,Late afternoon,Tiger shark,siglo - XXI,NaN,FATAL,Jun,Y,M,Tiger,18.0

In [3]:
#calculamos el porcentaje de nulos de nuestro df

nulos = pd.DataFrame((df.isnull().sum() * 100) / df.shape[0]).reset_index()
nulos.columns = ["columna", "porcentaje"]
nulos

                 columna  porcentaje
0            case_number    0.000000
1                   year    0.000000
2                   type    0.000000
3                country    0.598086
4                   area    2.751196
5               location    3.050239
6               activity    1.854067
7                   name    0.538278
8                   time    9.569378
9                species   10.167464
10                 siglo   10.167464
11              species_   97.368421
12                injury    0.478469
13                   mes    9.210526
14            fatal_bien    5.921053
15           genero_bien    0.000000
16  categorias_tiburones   59.928230
17                edades    9.449761

In [4]:
#descubrimos que la columna species_ contiene el 97% de nulos y también tenemos una columna con el 10% de nulos que contiene la misma información por lo que eliminaremos la primera.

df=df.drop('species_', axis=1)
df.head(2)

,case_number,year,type,country,area,location,activity,name,time,species,siglo,injury,mes,fatal_bien,genero_bien,categorias_tiburones,edades
0,2018.06.25,2018,Boating,usa,California,"Oceanside, San Diego County",Paddling,Julie Wolfe,18h00,White shark,siglo - XXI,"No injury to occupant, outrigger canoe and pad...",Jun,N,F,White,57.0
1,2018.06.03.a,2018,Unprovoked,brazil,Pernambuco,"Piedade Beach, Recife",Swimming,Jose Ernesto da Silva,Late afternoon,Tiger shark,siglo - XXI,FATAL,Jun,Y,M,Tiger,18.0

2.Es el momento de eliminar los nulos:
Reemplazad los valores nulos de la columna age por la media de la edad, redondeada a dos decimales.

In [5]:
df["edades"].replace(np.nan, df["edades"].mean(), inplace = True)
df["edades"]=df["edades"].round(decimals=2)
df["edades"].isnull().sum()

0

In [6]:
df["edades"]

0       57.00
1       18.00
2       15.00
3       32.00
4       21.00
        ...
1667    27.89
1668    27.89
1669    27.89
1670    27.89
1671    15.00
Name: edades, Length: 1672, dtype: float64

En relación a la columna de country al tratarse de una columna de tipo categórica, reemplazad los valores nulos por una nueva categória que se llame Unknown.

In [7]:
df["country"].replace(np.nan, "Unknow", inplace = True)
df["country"].isnull().sum()

0

Reemplazad los valores nulos de la columna fatal por Unknown.

In [8]:
df["fatal_bien"].replace(np.nan, "Unknow", inplace = True)
df["fatal_bien"].isnull().sum()

0

Reemplazad los valores nulos de la columna type por el valor más frecuente (la moda).

In [9]:
df["type"].replace(np.nan, df.type.mode()[0], inplace = True)
df["type"].isnull().sum()

0

Reemplazad los valores nulos de la columna fecha por Unknown.

In [10]:
df["mes"].replace(np.nan, "Unknow", inplace = True)
df["mes"].isnull().sum()

0

In [11]:
df["time"].replace(np.nan, "Unknow", inplace = True)
df["time"].isnull().sum()

0

In [12]:
df["siglo"].replace(np.nan, "Unknow", inplace = True)
df["siglo"].isnull().sum()

0

In [13]:
df["categorias_tiburones"].replace(np.nan, "Unknow", inplace = True)
df["categorias_tiburones"].isnull().sum()

0

In [14]:
nulos_nuevos = pd.DataFrame((df.isnull().sum() * 100) / df.shape[0]).reset_index()
nulos_nuevos.columns = ["columna", "porcentaje"]
nulos_nuevos

                 columna  porcentaje
0            case_number    0.000000
1                   year    0.000000
2                   type    0.000000
3                country    0.000000
4                   area    2.751196
5               location    3.050239
6               activity    1.854067
7                   name    0.538278
8                   time    0.000000
9                species   10.167464
10                 siglo    0.000000
11                injury    0.478469
12                   mes    0.000000
13            fatal_bien    0.000000
14           genero_bien    0.000000
15  categorias_tiburones    0.000000
16                edades    0.000000

In [15]:
df = df.rename(columns={'fatal_bien':'fatal',
                                   'genero_bien':'genero'})

df.columns

Index(['case_number', 'year', 'type', 'country', 'area', 'location',
       'activity', 'name', 'time', 'species', 'siglo', 'injury', 'mes',
       'fatal', 'genero', 'categorias_tiburones', 'edades'],
      dtype='object')

Guardad el csv para seguir trabajando con el en los siguientes ejercicios de pair.

In [16]:
df.to_csv('../Datos/attacks_limpieza_IV.csv', index=False)